#include <stdio.h>
#include <locale.h>
#include <math.h>
#include <time.h>
#define RAND_MAX 65536

//РџСЂРѕСЃС‚РѕРµ Р»Рё
int is_prime(int x) { 
    if (x != 0) { 
        for (int i = 2; i <= x / 2; i++) 
        if (x % i == 0) 
        return 0;
        
    }
    return 1;
}

//Р’Р·Р°РёРјРЅРѕ РїСЂРѕСЃС‚С‹Рµ
int are_both_prime(int a, int b) { 
  while (a && b) { 
    if (a >= b)
    a %= b;
    else
    b %= a;
  }
  return (a | b) == 1 ? 1 : 0;
}
int m = RAND_MAX, a = 1537, c = 0, x = 5289, x0;
int ar[RAND_MAX] = { 0 };
int b[RAND_MAX] = { 0 };
void srand(int seed) {
  x = seed;
}

// РџСЂРѕРІРµСЂРєР° СѓСЃР»РѕРІРёР№ СЃ
int get_c() {
  if (c % 2 == 0 || !are_both_prime(m, c))
  return 0;
  return 1;
} //РїРѕРґРѕР±СЂР°С‚СЊ СЃ

// СЃРѕР·РґР°С‚СЊ РїР°СЂР°РјРµС‚СЂС‹
void cr_parameter() {
  m = RAND_MAX;
  a = 1 + clock() % 32767;
  c = 1 + clock() % 4096;
  printf("РўРµРѕСЂРµРјР° Рѕ РјР°РєСЃ. РїРµСЂРёРѕРґРµ:\n");
  printf("РџРѕ СѓСЃР». С‚РµРѕСЂРµРјС‹ РїР°СЂР°РјРµС‚СЂС‹ c,m РґРѕР»Р¶РЅС‹ Р±С‹С‚СЊ РІР·Р°РёРјРЅРѕ РїСЂРѕСЃС‚С‹РјРё\n");
  printf("РџРѕ  СѓСЃР».  С‚РµРѕСЂРµРјС‹  Р°-1  РґРѕР»Р¶РµРЅ  РґРµР»РёС‚СЊСЃСЏ  РЅР°С†РµР»Рѕ   РЅР°  Р»СЋР±РѕРµ  РїСЂРѕСЃС‚РѕРµ  СЂ,  РЅР°  РєРѕС‚РѕСЂРѕРµ  РЅР°С†РµР»Рѕ  РґРµР»РёС‚СЃСЏ m\n");
  printf("РџРѕ СѓСЃР». С‚РµРѕСЂРµРјС‹ Р°-1 РґРѕР»Р¶РµРЅ РЅР°С†РµР»Рѕ РґРµР»РёС‚СЊСЃСЏ РЅР° 4, РµСЃР»Рё m РґРµР»РёС‚СЃСЏ РЅР°С†РµР»Рѕ РЅР° 4\n");
  printf("РЎР»РµРґСЃС‚РІРёРµ РёР· С‚РµРѕСЂРµРјС‹: a mod 8 = 5\n");
  int good_parameter = 0;
  while (!good_parameter) {
    c++;
    good_parameter = get_c();
  } // СЃ РїРѕРґРѕР±СЂР°РЅ
  good_parameter = 0;
  while (good_parameter!=1) {
    a++;
    if (a % 8 == 5)
    good_parameter = 1;
  } // Р° РїРѕРґРѕР±СЂР°РЅ
  printf("\nР° = %d, m = %d, c = %d. Р­С‚Рё РїР°СЂР°РјРµС‚СЂС‹ СѓРґРѕРІР»РµС‚РІРѕСЂСЏСЋС‚ СѓСЃР»РѕРІРёСЏРј С‚РµРѕСЂРµРјС‹\n", a, m, c);
}// СЃРіРµРЅРµСЂРёСЂРѕРІР°С‚СЊ РїРѕРґС…РѕРґСЏС‰РёРµ РїР°СЂР°РјРµС‚СЂС‹

 //true
int Rand() {
  x = ((a*x + c) % m) % 32;
  return x; 
}

// РјРѕС‰РЅРѕСЃС‚СЊ Рё РїРµСЂРёРѕРґ
void period_power() {
  x = x0;
  int i = 1;
  printf("РџРѕСЃР»РµРґРѕРІР°С‚РµР»СЊРЅРѕСЃС‚СЊ СЃ РїР°СЂР°РјРµС‚СЂР°РјРё Р° = %d, СЃ = %d, m = %d\n", a, c, m);
  for (i = 0; i < RAND_MAX; i++) { 
    if (i < 100)
    printf("%d ", ar[i] = Rand());
    else
    ar[i] = Rand();
  }
  printf("... Рё РµС‰С‘ 65435 СЌР»-С‚РѕРІ");
  int freq[RAND_MAX] = { 0 };
  int period_val = RAND_MAX;
  short found = 0;
  for (i = 0; i < RAND_MAX; i++) {
    freq[ar[i]]++;
    if (freq[ar[i]] > 1) {
      period_val = i;
      for (i = 0; i < period_val; i++)
      if (ar[period_val] == ar[i]) {
        if (ar[i] == ar[i + 1] && ar[i] == ar[i + 2]) {
          period_val = i;
          printf("\n\nРџРѕСЃР»РµРґРѕРІР°С‚РµР»СЊРЅРѕСЃС‚СЊ РІС‹СЂРѕР¶РґР°РµС‚СЃСЏ. %d СЌР». РґРѕ РІС‹СЂРѕР¶РґРµРЅРёСЏ\n", period_val);
          found = 1; break;
        }
        else if (ar[period_val + 1] == ar[i + 1] && ar[period_val + 2] == ar[i + 2]) {
          period_val -= i;
          printf("\n\nРњР°РєСЃРёРјР°Р»СЊРЅС‹Р№ РїРµСЂРёРѕРґ РїРѕСЃР»РµРґРѕРІР°С‚РµР»СЊРЅРѕСЃС‚Рё СЂР°РІРµРЅ %d\n", period_val);
          found = 1; break;
        }
        else {
          period_val = RAND_MAX;
          i = period_val + 1;
        }
      }
    }
    if (found)
    break;
  }
  double got = 0;
  double power = 0;
  while (modf(pow(a - 1, power) / m, &got) && power < 30)
    power++;
    if (!found)
    printf("\n\nРњР°РєСЃРёРјР°Р»СЊРЅС‹Р№ РїРµСЂРёРѕРґ РїРѕСЃР»РµРґРѕРІР°С‚РµР»СЊРЅРѕСЃС‚Рё СЂР°РІРµРЅ %d\n", period_val);
    printf( (power>=29) ? "\nРњР°РєСЃРёРјР°Р»СЊРЅР°СЏ РјРѕС‰РЅРѕСЃС‚СЊ РїРѕСЃР»РµРґРѕРІР°С‚РµР»СЊРЅРѕСЃС‚Рё РЅРµ РјРѕР¶РµС‚ Р±С‹С‚СЊ С‚РѕС‡РЅРѕ РІС‹С‡РёСЃР»РµРЅР° \n" : "\nРњР°РєСЃРёРјР°Р»СЊРЅР°СЏ РјРѕС‰РЅРѕСЃС‚СЊ РїРѕСЃР»РµРґРѕРІР°С‚РµР»СЊРЅРѕСЃС‚Рё = %d", (int)power);
    printf("\nР‘РѕР»СЊС€Р°СЏ РјРѕС‰РЅРѕСЃС‚СЊ РЅРµ РіР°СЂР°РЅС‚РёСЂСѓРµС‚ С…РѕСЂРѕС€РµР№ РїРѕСЃР»РµРґРѕРІР°С‚РµР»СЊРЅРѕСЃС‚Рё \n");
}

//С‚РµСЃС‚С‹
int first_test() {
  float n0 = 0, n1 = 0;
  int one[15] = { 0 }; // razryadi
  int null[15] = { 0 };
  for (int i = 0; i < m; i++) { 
    for (int j = 0; j < 15; j++) { 
      if (((1 << j) & ar[i]) == 0) {
        n0++;
        null[j]++;
      } 
      else {
        n1++;
        one[j]++;
      }
    }
  }
  printf("\nРЎСѓРјРјР°СЂРЅРѕРµ РєРѕР»-РІРѕ 0 Рё 1 РІ РґРІРѕРёС‡РЅС‹С… СЂР°Р·СЂСЏРґР°С… РїРѕ %d С‡РёСЃР»Р°Рј:\n", m);
  for (int i = 0; i < 15; i++)
  printf("Р’ СЂР°Р·СЂСЏРґРµ %d С‡РёСЃР»Рѕ РµРґРёРЅРёС† СЂР°РІРЅРѕ %d, С‡РёСЃР»Рѕ РЅСѓР»РµР№ СЂР°РІРЅРѕ %d\n", i, one[i], null[i]);
  printf("\n");
  printf("Р’ РїРѕСЃР»РµРґРѕРІР°С‚РµР»СЊРЅРѕСЃС‚Рё СЂР°СЃРїСЂРµРґРµР»РµРЅРёРµ РµРґРёРЅРёС‡РЅС‹С… Р±РёС‚РѕРІ СЂР°РІРЅРѕ %lf\n", n1/(n1+n0));
  printf("Р’ РїРѕСЃР»РµРґРѕРІР°С‚РµР»СЊРЅРѕСЃС‚Рё СЂР°СЃРїСЂРµРґРµР»РµРЅРёРµ РЅСѓР»РµРІС‹С… Р±РёС‚РѕРІ СЂР°РІРЅРѕ %lf\n", n0/(n1+n0));
  printf("РРґРµР°Р»СЊРЅРѕРµ СЂР°СЃРїСЂРµРґРµР»РµРЅРёРµ РґРѕР»Р¶РЅРѕ СЃРѕРґРµСЂР¶Р°С‚СЊ 0.5 Р±РёС‚ РєР°Р¶РґРѕРіРѕ РІРёРґР°\n");
  if (fabs(n1 / (n1 + n0) - n0/(n1+n0)) < 0.1) { 
    printf("\nРўРµСЃС‚ 1 Рѕ РґРѕРїСѓСЃС‚РёРјРѕРј СЂР°СЃРїСЂРµРґРµР»РµРЅРёРё Р±РёС‚РѕРІ РІ РїРѕСЃР»РµРґРѕРІР°С‚РµР»СЊРЅРѕСЃС‚Рё РїСЂРѕР№РґРµРЅ\n");
    return 1;
  } else {
    printf("\nРўРµСЃС‚ 1 Рѕ РґРѕРїСѓСЃС‚РёРјРѕРј СЂР°СЃРїСЂРµРґРµР»РµРЅРёРё Р±РёС‚РѕРІ РІ РїРѕСЃР»РµРґРѕРІР°С‚РµР»СЊРЅРѕСЃС‚Рё РїСЂРѕРІР°Р»РµРЅ\n");
    return 0;
  }
}

int second_test() {
  double s = 0;
  for (int i = 0; i < 100; i++) {
    for (int j = 0; j < 15; j++) {
      if (((1 << j) & ar[i]) == 0)
      s -= 1;
      else
      s += 1;
    }
  }
  s = fabs(s) / sqrt(100 * 15);
  if (erfc(s / sqrt(2)) > 0.01) {
    printf("\nР§Р°СЃС‚РѕС‚РЅС‹Р№ РїРѕР±РёС‚РѕРІС‹Р№ С‚РµСЃС‚ 2 РїСЂРѕР№РґРµРЅ\n");
    return 1;
  } else {
    printf("\nР§Р°СЃС‚РѕС‚РЅС‹Р№ РїРѕР±РёС‚РѕРІС‹Р№ С‚РµСЃС‚ 2 РїСЂРѕРІР°Р»РµРЅ\n");
    return 0;
  }
}

int third_test() {
  double p = 0;
  for (int i = 0; i < m; i++) {
    for (int j = 0; j < 15; j++) {
      if (((1 << j) & ar[i]) != 0)
      p += 1;
    }
  }
  p /= m * 16;
  if (fabs(p - 0.5) > 2 / sqrt(p)) {
    printf("\nРўРµСЃС‚ 3 РЅР° РѕРґРёРЅР°РєРѕРІС‹Рµ РёРґСѓС‰РёРµ РїРѕРґСЂСЏРґ Р±РёС‚С‹ РїСЂРѕРІР°Р»РµРЅ\n");
    return 0;
  } else {
    int rk;
    int Vn = 0;
    for (int i = 0; i <50; i++) { 
      for (int j = 1; j < 16; j++) {
        if (((1 << j - 1) & ar[i]) != 0 && ((1 << j) & ar[i]) != 0)
        rk = 0;
        else if (((1 << j) & ar[i]) == 0 && ((1 << j - 1) & ar[i]) == 0)
        rk = 0;
        else
        rk = 1;
        Vn += rk;
      }
      Vn++;
      if (erfc(fabs((Vn - (2 * p*(1 - p)*m)) / (2 * p*(1 - p)*sqrt(2 * m * 16))) / 100) < 0.01) {
        printf("\nРўРµСЃС‚ 3 РЅР° РѕРґРёРЅР°РєРѕРІС‹Рµ РёРґСѓС‰РёРµ РїРѕРґСЂСЏРґ Р±РёС‚С‹ РїСЂРѕРІР°Р»РµРЅ\n");
        return 0;
      }
      Vn = 0;
    }
    printf("\nРўРµСЃС‚ 3 РЅР° РѕРґРёРЅР°РєРѕРІС‹Рµ РёРґСѓС‰РёРµ РїРѕРґСЂСЏРґ Р±РёС‚С‹ РїСЂРѕР№РґРµРЅ\n");
    return 1;
  }
}

// Р·Р°РїСѓСЃС‚РёС‚СЊ С‚РµСЃС‚ РїРѕСЃР»РµРґРѕРІР°С‚РµР»СЊРЅРѕСЃС‚Рё
void demo() {
  int freq[RAND_MAX] = { 0 };
  printf("РџРѕСЃР»РµРґРѕРІР°С‚РµР»СЊРЅРѕСЃС‚СЊ СЃ РїР°СЂР°РјРµС‚СЂР°РјРё Р° = %d, СЃ = %d, m = %d\n", a, c, m);
  for (int i = 0; i < RAND_MAX; i++) {
    if (i < 100)
    printf("%d ", ar[i] = Rand());
    else
    ar[i] = Rand();
    freq[ar[i]]++;
  }
  printf("... Рё РµС‰С‘ 65435 СЌР»-С‚РѕРІ");
  printf("\nРџРѕС…РѕР¶Р° Р»Рё РѕРЅР° РЅР° СЃР»СѓС‡Р°Р№РЅСѓСЋ?\n");
//
  int min = ar[0], max = ar[0], freq_min=-1, freq_max=-1;
  for (int i = 0; i < RAND_MAX; i++)
  if (freq[ar[i]] > freq_max ) {
    max = ar[i];
    freq_max = freq[ar[i]];
  }
  freq_min = freq_max;
  for (int i = 0; i < RAND_MAX; i++)
  if (freq[i] < freq_min) {
    min = i;
    freq_min = freq[i];
  }
  printf("\nРњР°РєСЃРёРјСѓРј:   С‡РёСЃР»Рѕ   %d   РІСЃС‚СЂРµС‡Р°РµС‚СЃСЏ   %d   СЂР°Р·\nРњРёРЅРёРјСѓРј:   С‡РёСЃР»Рѕ   %d   РІСЃС‚СЂРµС‡Р°РµС‚СЃСЏ   %d   СЂР°Р·\n",   max, freq_max, min, freq_min);
//printf("\n %d  %d \n", max, freq_max, min, freq_min);
//
  if (first_test(ar) && second_test(ar) && third_test(ar))
  printf("\nРҐРѕСЂРѕС€РёР№ РіРµРЅРµСЂР°С‚РѕСЂ\n");
  else
  printf("\nРџР»РѕС…РѕР№ РіРµРЅРµСЂР°С‚РѕСЂ\n");
  }//РїСЂРѕРІРµСЂРєР° СЃ С‚РµСЃС‚Р°РјРё

// РІРІРµСЃС‚Рё СЃРІРѕРё РїР°СЂР°РјРµС‚СЂС‹
void enter() {
  do
  printf((printf("РџР°СЂР°РјРµС‚СЂ a= "), scanf("%d", &a), a < 0 || a>RAND_MAX) ? "РќРµРґРѕРїСѓСЃС‚РёРјРѕРµ С‡РёСЃР»Рѕ\n" : "");
  while (a < 0 || a>RAND_MAX);
  do
  printf((printf("РџР°СЂР°РјРµС‚СЂ c= "), scanf("%d", &c), c < 0 || c>RAND_MAX) ? "РќРµРґРѕРїСѓСЃС‚РёРјРѕРµ С‡РёСЃР»Рѕ\n" : "");
  while (c < 0 || c>RAND_MAX);
  do
  printf((printf("РџР°СЂР°РјРµС‚СЂ m= "),  scanf("%d",  &m), m  <= 0  ||  m>RAND_MAX)  ? "РќРµРґРѕРїСѓСЃС‚РёРјРѕРµ  С‡РёСЃР»Рѕ\n" :"");
  while (m <= 0 || m>RAND_MAX);
  do
  printf((printf("РџР°СЂР°РјРµС‚СЂ x0= "),  scanf("%d",  &x), x  < 0  ||  x>RAND_MAX)  ? "РќРµРґРѕРїСѓСЃС‚РёРјРѕРµ  С‡РёСЃР»Рѕ\n" :"");
  while (x < 0 || x>RAND_MAX);
  x0 = x;
  demo();
}//СЃРІРѕР№ РІРІРѕРґ РїР°СЂР°РјРµС‚СЂРѕРІ
//

void vivod1() {
  int k=0;
  do {
    printf("Р’С‹РІРµСЃС‚Рё СЌР»РµРјРµРЅС‚РѕРІ: ");
    scanf("%d", &k);
  } 
  while (k < 0 || k>RAND_MAX);
  for (int i = 0; i < k; i++)
  printf("%d\t",ar[i]);
  printf("\n");
}

int main() {
  setlocale(LC_ALL, "rus");
  enum menu { out, create, test, vvod, pp , vivod };
//printf("%d %d\n", out, vvod);
  printf("Р“РµРЅРµСЂР°С‚РѕСЂ СЃР»СѓС‡Р°Р№РЅС‹С… С‡РёСЃРµР»\n");
  int err = 1;
  while (1) { 
    printf("\n\n0-Р’С‹С…РѕРґ\n1-РЎРіРµРЅРµСЂРёСЂРѕРІР°С‚СЊ   РїРѕРґС…РѕРґСЏС‰РёРµ   РїР°СЂР°РјРµС‚СЂС‹\n2-РўРµСЃС‚ РїР°СЂР°РјРµС‚СЂРѕРІ\n3-РўРµСЃС‚ РїСЂРѕРёР·РІРѕР»СЊРЅС‹С… РїР°СЂР°РјРµС‚СЂРѕРІ\n4-РќР°Р№С‚Рё РјР°РєСЃ. РјРѕС‰РЅРѕСЃС‚СЊ Рё РїРµСЂРёРѕРґ\n5-Р’С‹РІРµСЃС‚Рё СЌР»-С‚С‹ РјР°СЃСЃРёРІР°\n\n");
    int choose;
    scanf("%d", &choose);
    switch (choose) {
      case out: { return 0; }
      case create: { cr_parameter(); err = 0; break; }
      case test: { (err == 0) ? demo() : printf("РЎРЅР°С‡Р°Р»Р° РЅСѓР¶РЅРѕ СЃРѕР·РґР°С‚СЊ РїР°СЂР°РјРµС‚СЂС‹ РіРµРЅРµСЂР°С‚РѕСЂР° РёР»Рё РІРІРµСЃС‚Рё РёС… РІСЂСѓС‡РЅСѓСЋ\n"); break; }
      case vvod: {  enter(); err = 0; break; }
      case pp: {  (err == 0) ? period_power() : printf("РЎРЅР°С‡Р°Р»Р° РЅСѓР¶РЅРѕ СЃРѕР·РґР°С‚СЊ РїР°СЂР°РјРµС‚СЂС‹ РіРµРЅРµСЂР°С‚РѕСЂР° РёР»Рё РІРІРµСЃС‚Рё РёС… РІСЂСѓС‡РЅСѓСЋ\n"); break; }
      case vivod: {vivod1(); break; }
      default: { printf("РўР°РєРѕР№ РєРѕРјР°РЅРґС‹ РЅРµ СЃСѓС‰РµСЃС‚РІСѓРµС‚\n"); break; }
    }
  }
  getchar();
  return 0;
}
